[
  {
    "href": "grid/1D8A2653.min.webp",
    "alt_text": "Small, frosted cake with delicate flowers arranged on top, displayed on a clear cake stand."
  },
  {
    "href": "grid/1D8A2673.min.webp",
    "alt_text": "Brownie bites topped with cream and flowers on a white plate. Dessert treats for a celebration."
  },
  {
    "href": "grid/1D8A2693.min.webp",
    "alt_text": "Close-up of violet macarons with rose petals on a white plate, creating a delicate and floral dessert presentation."
  },
  {
    "href": "grid/1D8A2708.min.webp",
    "alt_text": "Miniature cakes with cream and edible flowers arranged on a tiered cake stand and a plate."
  },
  {
    "href": "grid/1D8A2718.min.webp",
    "alt_text": "Mini chocolate cakes with whipped cream and edible flowers on a white platter, displayed for a dessert table."
  },
  {
    "href": "grid/1D8A2726.min.webp",
    "alt_text": "Colorful rice crispy treats arranged on a plate, dusted with sprinkles, and served with a side of fruit."
  },
  {
    "href": "grid/1D8A3238.min.webp",
    "alt_text": "Two brides kiss near a wedding cake with floral accents, celebrating their marriage in a warmly lit venue."
  },
  {
    "href": "grid/1D8A3324.min.webp",
    "alt_text": "Two brides share a tiered cake, smiling, at a wedding celebration. Floral details adorn the cake and hair."
  },
  {
    "href": "grid/1D8A3703-Edit-2.min.webp",
    "alt_text": "Couple shares pizza, laughing; woman in a pink hat and man in a suit enjoying a casual moment at a brick-walled restaurant."
  },
  {
    "href": "grid/1D8A4599.min.webp",
    "alt_text": "Close-up of a tiered wedding cake decorated with fresh flowers on a cake stand."
  },
  {
    "href": "grid/1D8A4607-1.min.webp",
    "alt_text": "Couple cuts a wedding cake decorated with flowers, smiling and celebrating their special day."
  },
  {
    "href": "grid/1D8A5343.min.webp",
    "alt_text": "A person with dark hair and a white dress receives a hug from another person, both smiling with glitter on their faces."
  },
  {
    "href": "grid/373A7952.min.webp",
    "alt_text": "Small vanilla cake decorated with blackberries, lavender, and succulents on a wooden board."
  },
  {
    "href": "grid/380A6833_FULL.min.webp",
    "alt_text": "Close-up of a strawberry shortcake square with a crumbly texture and pink frosting."
  },
  {
    "href": "grid/380A6863_FULL.min.webp",
    "alt_text": "Fluffy pink marshmallows stacked on a wooden surface, showcasing a close-up view of their soft texture."
  },
  {
    "href": "grid/380A6932_FULL.min.webp",
    "alt_text": "Close-up of a chocolate chip cookie held in two hands, revealing a crumbly texture and melted chocolate chips."
  },
  {
    "href": "grid/380A6986_FULL.min.webp",
    "alt_text": "Close-up of three chocolate truffles on a wooden surface, showcasing their rich color and smooth texture."
  },
  {
    "href": "grid/bb-209final.min.webp",
    "alt_text": "Person holding a strawberry cake slice, smiling, with curly red hair and elaborate eye makeup, wearing a lace dress."
  },
  {
    "href": "grid/bb-214final.min.webp",
    "alt_text": "Golden-brown cream puffs dusted with powdered sugar, arranged on a white plate with fresh herbs."
  },
  {
    "href": "grid/bb-219final.min.webp",
    "alt_text": "Colorful Japanese mochi cakes arranged on a white plate, garnished with dark chocolate shavings. A traditional dessert."
  },
  {
    "href": "grid/bb-220final.min.webp",
    "alt_text": "Small porcelain bowls filled with vibrant red chili paste and crispy fried garlic. A close-up food still life."
  },
  {
    "href": "grid/bb-221final.min.webp",
    "alt_text": "Chocolate truffles arranged on a blue and white patterned plate, garnished with chocolate shavings and delicate pink flowers."
  },
  {
    "href": "grid/bb-232final.min.webp",
    "alt_text": "Layered cake on a pedestal, adorned with flowers and blue icing, sits on a table with vintage china."
  },
  {
    "href": "grid/bb-293final.min.webp",
    "alt_text": "Red velvet truffles on a white plate, held by a hand with red nail polish. Sweet dessert treat."
  },
  {
    "href": "grid/bb-74final.min.webp",
    "alt_text": "Two women share a table laden with food and flowers during an outdoor picnic in a garden."
  },
  {
    "href": "grid/bb-76final.min.webp",
    "alt_text": "Lemon mousse dessert with blueberry garnish and edible flower petals arranged in a white ramekin."
  },
  {
    "href": "grid/DSC_3097-Edit.min.webp",
    "alt_text": "Blue ceramic plate with meringue cookies rests on a floral bed, held by a hand with blue nail polish."
  },
  {
    "href": "grid/DSC_3224-Edit.min.webp",
    "alt_text": "Hands holding a blue ceramic dish with truffles and edible flowers."
  },
  {
    "href": "grid/DSC_6685-Edit.min.webp",
    "alt_text": "Woman in a wedding dress sits in a forest, holding a small cake, surrounded by flowers."
  },
  {
    "href": "grid/IMG_0175.min.webp",
    "alt_text": "Assorted mochi donuts with sesame seeds arranged on a platter, garnished with a red flower."
  },
  {
    "href": "grid/IMG_0187.min.webp",
    "alt_text": "Blueberry muffins in white paper liners sit on a wooden surface, dusted with powdered sugar."
  },
  {
    "href": "grid/IMG_0195.min.webp",
    "alt_text": "Tiered display of chocolate brownies, dusted with powdered sugar, presented on a cake stand."
  },
  {
    "href": "grid/IMG_20200228_200820_276.min.webp",
    "alt_text": "Elegant white cake on a glass stand, decorated with fresh flowers and edible pearl accents. Perfect for a special occasion."
  },
  {
    "href": "grid/IMG_20200228_201353_503.min.webp",
    "alt_text": "Assorted miniature desserts on a slate platter, featuring mousse tarts and flower garnishes. A knife rests nearby."
  },
  {
    "href": "grid/IMG_20250524_093944_174.min.webp",
    "alt_text": "Mini chocolate lava cakes with a dollop of whipped cream and toasted marshmallows on a white tray."
  },
  {
    "href": "grid/IMG_2635.min.webp",
    "alt_text": "Yogurt parfait with fresh raspberries, blueberries, and granola in a glass bowl, viewed from above."
  },
  {
    "href": "grid/IMG_3333.min.webp",
    "alt_text": "Coconut cream pie slice with whipped cream and toasted coconut flakes on a white plate."
  },
  {
    "href": "grid/IMG_6879.min.webp",
    "alt_text": "Halva dessert pieces on a blue and white patterned ceramic plate, presented on a wooden surface."
  },
  {
    "href": "grid/PXL_20230917_182326941.PORTRAIT.min.webp",
    "alt_text": "Vanilla cake with white frosting and pink flower accents on a cake stand."
  },
  {
    "href": "grid/PXL_20231006_205403138.min.webp",
    "alt_text": "Dessert table with tiered displays of colorful cupcakes, cookies, and brownies, decorated with pumpkins and fall foliage."
  },
  {
    "href": "grid/PXL_20231006_205412427.min.webp",
    "alt_text": "Chocolate brownies topped with edible flowers sit on a wooden board, alongside a tiered display of coconut macaroons."
  },
  {
    "href": "grid/PXL_20231006_205733822.PORTRAIT.min.webp",
    "alt_text": "Layer cake with vanilla frosting and fresh blueberries on a cake stand."
  },
  {
    "href": "grid/PXL_20231006_205737481.PORTRAIT.ORIGINAL.min.webp",
    "alt_text": "Cinnamon rice treats arranged on a wooden board, garnished with greenery. A delicious and festive dessert."
  },
  {
    "href": "grid/PXL_20231006_210257927.min.webp",
    "alt_text": "Assorted cupcakes on tiered stands and blue china plates, ready for a dessert table. Stacked paper plates nearby."
  },
  {
    "href": "grid/PXL_20231006_210306234.PORTRAIT.min.webp",
    "alt_text": "Assorted cupcakes with white frosting and edible flower garnishes displayed on a table."
  },
  {
    "href": "grid/PXL_20231006_210308357.PORTRAIT.min.webp",
    "alt_text": "Mini trifle desserts in clear cups with whipped cream and cherry topping, arranged on a dessert table."
  },
  {
    "href": "grid/PXL_20231006_210310269.PORTRAIT.min.webp",
    "alt_text": "Mini cupcakes arranged on a wooden tiered stand. The cupcakes have vanilla frosting and chocolate sprinkles."
  },
  {
    "href": "grid/PXL_20250425_183837116.PORTRAIT.min.webp",
    "alt_text": "Vanilla cake with buttercream frosting and fresh thyme and pansy flowers arranged on top."
  },
  {
    "href": "grid/Screenshot 2025-06-22 at 12.27.37 PM.min.webp",
    "alt_text": "Woman pouring champagne into a glass on a tray with macarons, enjoying a relaxing moment."
  },
  {
    "href": "grid/Screenshot 2025-06-22 at 12.28.11 PM.min.webp",
    "alt_text": "Three women in robes relax on a sofa, enjoying wine and snacks in a cozy, nature-inspired setting."
  },
  {
    "href": "grid/Screenshot_20250605-120128.min.webp",
    "alt_text": "Tiered wedding cake with a bride and groom cake topper, decorated with fruit and flowers on a decorative stand."
  },
  {
    "href": "grid/Screenshot_20250605-120137.min.webp",
    "alt_text": "Close-up of a vanilla cake decorated with vibrant orange and yellow flower petals on a white plate."
  }
]