[
  {
    "href": "grid/373A7952.jpg",
    "alt_text": "Top view of a frosted cake adorned with succulents and blackberries, placed on a wooden board, surrounded by blue patterned dishes."
  },
  {
    "href": "grid/DSC_3097-Edit.jpg",
    "alt_text": "Woman holding a blue plate with assorted truffles, next to a bouquet of flowers, on a bride's lace dress background."
  },
  {
    "href": "grid/DSC_3224-Edit.jpg",
    "alt_text": "Hands holding a blue floral plate with chocolates and a flower, wearing elegant lace clothing and blue nail polish."
  },
  {
    "href": "grid/DSC_6685-Edit.jpg",
    "alt_text": "Bride in elegant white lace gown eats berries in a forest setting, surrounded by greenery and flowers, creating a whimsical scene."
  },
  {
    "href": "grid/IMG_0175.jpg",
    "alt_text": "Chocolate fudge squares topped with sesame seeds arranged on a tray, accompanied by a red flower."
  },
  {
    "href": "grid/IMG_0187.jpg",
    "alt_text": "Homemade granola bars in cupcake liners with floral arrangement in background. Dessert table display, rustic kitchen scene."
  },
  {
    "href": "grid/IMG_0195.jpg",
    "alt_text": "Assorted dessert display with brownies and bars on a tiered wooden stand, decorated with colorful flowers."
  },
  {
    "href": "grid/IMG_20200228_200820_276.jpg",
    "alt_text": "Elegant white frosted cake adorned with pink pearls and floral decorations on a glass stand. Ideal for weddings or celebrations."
  },
  {
    "href": "grid/IMG_20200228_201353_503.jpg",
    "alt_text": "Gourmet dessert platter with assorted pastries, cheese, and garnishes on a rustic slate board; elegant dining setting."
  },
  {
    "href": "grid/IMG_2635.jpg",
    "alt_text": "Bowl of yogurt topped with raspberries, blueberries, and granola on a wooden table."
  },
  {
    "href": "grid/IMG_3333.jpg",
    "alt_text": "Plate of dessert with creamy layers, shredded coconut topping, and whipped cream, served on a wooden table."
  },
  {
    "href": "grid/IMG_6879.jpg",
    "alt_text": "Vintage plate with assorted chocolates on a wooden platter, decorative rug, and flower, creating a rustic dessert display."
  },
  {
    "href": "grid/PXL_20210625_205213030.jpg",
    "alt_text": "Charcuterie board with assorted meats, cheeses, figs, strawberries, blackberries, blueberries, apricots, pickles, and crackers."
  },
  {
    "href": "grid/PXL_20210625_205232287.jpg",
    "alt_text": "Charcuterie board with meats, cheeses, fruits, and nuts at a baby shower celebration. \"Welcome Baby\" sign in the background."
  },
  {
    "href": "grid/PXL_20230917_182326941.PORTRAIT.jpg",
    "alt_text": "Elegant white cake with meringue decorations, green leaves, and pink flowers on top, displayed on a glass cake stand."
  },
  {
    "href": "grid/PXL_20231006_205403138.jpg",
    "alt_text": "Dessert table display with cupcakes, cake, brownies, and rice crispy treats on blue tablecloth. Rustic decor with white pumpkins and yellow flowers."
  },
  {
    "href": "grid/PXL_20231006_205412427.jpg",
    "alt_text": "Chocolate brownies with floral garnishes, displayed on a wooden board at a dessert table with cake slices in the background."
  },
  {
    "href": "grid/PXL_20231006_205733822.PORTRAIT.jpg",
    "alt_text": "Elegant vanilla cake topped with fresh blueberries and green leaves on a glass stand. Perfect for weddings or special occasions."
  },
  {
    "href": "grid/PXL_20231006_205737481.PORTRAIT.ORIGINAL.jpg",
    "alt_text": "Cinnamon Rice Crispy Treats on wooden platter with green garnish, displayed on blue tablecloth at event."
  },
  {
    "href": "grid/PXL_20231006_210257927.jpg",
    "alt_text": "Rustic dessert table with assorted cupcakes, a layered cake, and desserts in a vintage setting."
  },
  {
    "href": "grid/PXL_20231006_210306234.PORTRAIT.jpg",
    "alt_text": "Assorted cupcakes with cream frosting and edible flowers on display at a bakery."
  },
  {
    "href": "grid/PXL_20231006_210308357.PORTRAIT.jpg",
    "alt_text": "Mini parfait desserts with whipped cream topping and crumble, garnished with edible flowers, displayed on a table."
  },
  {
    "href": "grid/PXL_20231006_210310269.PORTRAIT.jpg",
    "alt_text": "Tiered wooden stand with assorted s'mores cupcakes topped with golden marshmallow frosting, decorated with green leaves."
  }
]
