[
  {
    "name": "Christine Rotondo",
    "content": "I cannot speak highly enough about Heather's cakes!!!!! We ordered the brown butter cake and the carrot cake... both of which were not only BEAUTIFUL but EXTREMELY DELICIOUS. Words do not describe. Filling, flavorful, not toooooo sweet, perfect thickness and cake / frosting ratio. So good I had to pace myself. People at our wedding were telling us these were the best cakes they've ever had and asking where they can order from. Usually people save a piece of their wedding cake, but we didn't because it was so good - we ate all of it... and might order another for our anniversary!!!\n\nHeather also went above and beyond in cleaning and placing my parent's antique cake topper onto our wedding cake. Her communication is clear and timely, answering all of my questions. Her pricing is a steal in comparison to the quality she provides. She puts so much care, even delivered and set up the cakes on site. What I really love is how focused she is on taste rather than frills, and still, her cakes are beautifully designed with flowers and pieces of nature.\n\nFor real... SO GOOD!!!!"
  },
  {
    "name": "Amy Langman",
    "content": "Helene happened 3 weeks before our original wedding date, so I spent many months dreaming about this cake! I wanted something very simple since we had a custom cake topper and heather nailed it.\n\nThe brown butter cake was deliciously moist, not overly sweet and while I sadly do not have a photo of the layers, I promise that they were PERFECT, not that any of my guests noticed because they devoured this beauty so fast! I asked for either a raspberry or strawberry filling, whichever was available so it was a fun little surprise reveal for myself.\n\nHeather was so kind and enjoyable to work with and my only regret is not being there during the delivery so I could have given her a hug!"
  },
  {
    "name": "Evan Donnelly",
    "content": "Heather made chocolate eclairs for my wedding, and they were SO GOOD. Not only did they taste amazing—they looked amazing too. I reached out to her very early on in my wedding planning, and she was so helpful every step of the way. She stayed for my room flip to help with the dessert table when she didn't have to, and she is very responsive in communication. Highly, highly recommend—such a talented pastry chef and a very kind human."
  },
  {
    "name": "Clay Becker",
    "content": "For our wedding, we knew we wanted to cater lemon bars as they're my wife's favorite dessert. I contacted Heather about it and she was absolutely down to make that happen, even though it was off-menu- and I can't lie, they were literally the best lemon bars I have ever had in my life. Incredible service, very easy to work with, and delivered absolutely world class desserts at the end of the process. I can't recommend Lilly Mays enough for pastries in western NC!"
  },
  {
    "name": "Ben Pegg",
    "content": "Each bite of Lilly Mays feels crafted, like it was made by hands that understand how simple things, done well, can be remarkable. There's so much care in what Heather does. It shows in the textures, which are smooth when they need to be, and rich where you want it to be.\n\nThe flavors speak for themselves. Real and bold.\nThe kind that stick with you long after the last bite.\n\nHeather is friendly and carries a quiet confidence. —and without even trying, It's clear she knows exactly what she's doing."
  },
  {
    "name": "JJ G.",
    "content": "I have tried several local bakers trying to find the right mix of quality, price, decoration, and flavor and this has finally met my high expectations! I ordered a cake and assorted treats and my family raved about them all weekend. Already placed a second order and will continue to purchase in the future."
  },
  {
    "name": "Michaela Shaw",
    "content": "Heather is a true pastry genius. Her desserts are classy, delicious, and presented beautifully! Her creations are a brilliant balance of classic and unique. She is a delight to work with, communicative and so sweet. I can't recommend Lilly May's enough!"
  },
  {
    "name": "Kaitlyn Kynerd",
    "content": "Absolutely incredible. When you're looking for the perfect desert for your event that is non commercial, tastes like love was poured into it, and makes all your guests ask \"where did these come from?!\"….. there's only once answer. Lilly May's Desserts. Beyond the flavor profile speaking for itself, Heather, the business owner, is a pleasure to work with. She is professional, accommodating, and genially cares about your ideas and brings them to life. She is excited to work with you and makes your ideas feel special and valued. Absolutely reach out and support a local, friendly, and talented business that will make your ideas blossom into something tasty and beautiful."
  },
  {
    "name": "Yugank Sikka",
    "content": "Lilly May's was the best choice we made for our wedding! Not only were they able to deliver a wedding dessert bar with a diverse menu, they were incredibly easy to coordinate with. Heather is very responsive and detail-oriented and worked closely with us to curate a dessert menu that incorporated each of our favorite desserts in bite-sized options for our guests. This included: Caramel Cheesecake Bites, Tres Leches Cake Cups, Red Velvet Cupcakes, Strawberry Torte Bites, Panna Cotta Cups and Tiramisu Cheesecake bites. My wife has celiac and Heather was even able to make most of our desserts gluten free without compromising the taste whatsoever!"
  },
  {
    "name": "Lillian Bacon",
    "content": "Heather is a consummate professional and her desserts are works of art! And that's coming from someone who's not a dessert person... She's kind and knowledgeable and walked me through the entire process without ever making me feel uninformed (which I was) or excessive (I had *many* questions). Then, and at the end of it all, she delivered exactly what we'd discussed, except for that it tasted even better than I'd imagined. Will 1000% use her again."
  },
  {
    "name": "Cat M",
    "content": "These desserts never disappoint! Highly recommend this local pastry chef as her food is delicious and made with intentional effort & care. I've sampled a number of her creations, never not being in awe of the combination of flavors. Her chocolate torte & tiramisu cheesecake are 2 of my recent favorites!"
  }
]
